Documents/ЗаявкаНаЗакупку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаЗакупку</Name>
			<BasedOn>
				<xr:Item>Catalog.Партнеры</xr:Item>
				<xr:Item>Catalog.СоглашенияСПоставщиками</xr:Item>
				<xr:Item>Catalog.СделкиСКлиентами</xr:Item>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
				<xr:Item>Document.ЗаказНаПеремещение</xr:Item>
				<xr:Item>Document.ЗаказНаСборку</xr:Item>
				<xr:Item>Document.ИзменениеАссортимента</xr:Item>
				<xr:Item>Document.ЗаявкаНаВозвратТоваровОтКлиента</xr:Item>
				<xr:Item>Document.ЗаказНаВнутреннееПотребление</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗапасыИПотребности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеОднойДатой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаЗакупку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельЗакупки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦелиЗакупки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураПартнера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЖелаемаяДатаПоступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Соглашение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦеныПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦенПоставщиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджетов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалогообложениеНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Протокол</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗаявокНаЗакупку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыЗаявокНаЗакупку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаЗакупку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВыполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЦелиЗакупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЦелиЗакупки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяДеятельность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственныеНужды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвестиции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаЗакупку/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Не Согласован
		И Перечисления.СтатусыЗаявокНаЗакупку.Согласована(Статус)
		И ПраваПользователяПовтИсп.СогласованиеЗаявокНаЗакупку() // Автор может закрыть заявку, но это не будет согласованием.
		И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		// Проверки заполнения пройдены, устанавливается статус "согласования".
		Согласован = Истина;
	КонецЕсли;
	
	ЗаполнитьПустыеЖелаемыеДатыПоступления();
	
	РаботаСПротоколомДокумента.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	НоменклатураСервер.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи);
	
	СуммаДокумента = Товары.Выгрузить(Новый Структура("Отменено", Ложь)).Итог("СуммаСНДС");
	
	Если Не ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Автор) И ЭтоНовый() Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;

	НоменклатураСервер.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ);
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект,НепроверяемыеРеквизиты,Отказ);
	
	// Склады проверяются только при наличии товаров / тары
	НепроверяемыеРеквизиты.Добавить("Товары.Склад");
	НепроверяемыеРеквизиты.Добавить("Склад");
	ЗакупкиСервер.ПроверитьКорректностьЗаполненияДокументаЗакупки(ЭтотОбъект, Отказ);
	
	НепроверяемыеРеквизиты.Добавить("Товары.Подразделение");
	ОписаниеПроверокПодразделений = Новый Соответствие;
	ОписаниеПроверокПодразделений.Вставить(
		Перечисления.ТипыНоменклатуры.Услуга, 
		НСтр("ru = 'Не указан получатель услуг в строке %1 списка Товары'"));
		
	ОписаниеПроверокПодразделений.Вставить(
		Перечисления.ТипыНоменклатуры.Работа, 
		НСтр("ru = 'Не указан получатель работ в строке %1 списка Товары'"));
		
	Для Каждого КлючиИЗначение Из ОписаниеПроверокПодразделений Цикл
		ЗапасыСервер.ПроверитьЗаполнениеПодразделенияВТабличнойЧасти(
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КлючиИЗначение.Ключ),
			КлючиИЗначение.Значение,
			Отказ);
	КонецЦикла;
	
	ИспользоватьЛимитыБДР = Документы.ЗаявкаНаЗакупку.ИспользоватьЛимитыБДР();
	КонтролироватьЛимитыБДР = ИспользоватьЛимитыБДР
		И Перечисления.СтатусыЗаявокНаЗакупку.Согласована(Статус) // Заявка согласована
		И ЦельЗакупки = Перечисления.ЦелиЗакупки.СобственныеНужды;
	
	Если Не ИспользоватьЛимитыБДР Тогда
		НепроверяемыеРеквизиты.Добавить("ЦельЗакупки");
	КонецЕсли;
	
	Если Не КонтролироватьЛимитыБДР Тогда
		ИменаРеквизитовАналитикЛимитирования = Документы.ЗаявкаНаЗакупку.ИменаРеквизитовАналитикЛимитирования();
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НепроверяемыеРеквизиты, ИменаРеквизитовАналитикЛимитирования);
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	ПараметрыВыбораСтатейИАналитик = Документы.ЗаявкаНаЗакупку.ПараметрыВыбораСтатейИАналитик(ЦельЗакупки);
	ДоходыИРасходыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ПараметрыВыбораСтатейИАналитик);
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДатаСеанса();
	Протокол.Очистить();
	Комментарий = Неопределено;
	Статус = Перечисления.СтатусыЗаявокНаЗакупку.НаСогласовании;
	ИнициализироватьДокумент(ОбъектКопирования);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	ТребуетсяЗаполнениеПоСтатистике = Истина;
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);
		ТребуетсяЗаполнениеПоСтатистике = Ложь;
	КонецЕсли;
	
	Если ТребуетсяЗаполнениеПоСтатистике Тогда
		ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ЗаполнитьДокументПоОтбору(Знач ДанныеЗаполнения)
	
	// Перечень реквизитов, которые нельзя копировать из отбора:
	НезаполняемыеРеквизиты = Новый Массив;
	НезаполняемыеРеквизиты.Добавить("Проведен");
	НезаполняемыеРеквизиты.Добавить("ПометкаУдаления");
	НезаполняемыеРеквизиты.Добавить("Автор");
	НезаполняемыеРеквизиты.Добавить("Статус");
	НезаполняемыеРеквизиты.Добавить("Исполнитель");
	
	ИсключаемыеРеквизиты = Новый Массив;
	Для Каждого НезаполняемыйРеквизит Из НезаполняемыеРеквизиты Цикл
		Если Не ДанныеЗаполнения.Свойство(НезаполняемыйРеквизит) Тогда
			Продолжить;
		КонецЕсли;
		
		ИсключаемыеРеквизиты.Добавить(НезаполняемыйРеквизит);
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИсключаемыеРеквизиты) Тогда
		ИсключаемыеРеквизиты = СтрСоединить(ИсключаемыеРеквизиты, ", ");
	Иначе
		ИсключаемыеРеквизиты = Неопределено;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,, ИсключаемыеРеквизиты);
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ДанныеЗаполнения.Свойство("Товары") Тогда
		Товары.Загрузить(ДанныеЗаполнения.Товары);
	КонецЕсли;
	
	ПроверитьЗаполнитьПоступлениеОднойДатой();
	
	Если ДанныеЗаполнения.Свойство("Товары") Тогда //Заполнение из обработки "Обеспечение потребностей".
		
		Если Не ЗначениеЗаполнено(Валюта) Тогда
			Валюта = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(Валюта);
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Исполнитель") Тогда
			Исполнитель = ДанныеЗаполнения.Исполнитель;
		КонецЕсли;
		
		Действия = Новый Структура;
		Действия.Вставить("ЗаполнитьКонтрагентаПартнераПоУмолчанию", Истина);
		
		ПараметрыЗаполненияДоговора = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияДоговораПоУмолчанию();
		ПараметрыЗаполненияДоговора.Организация = Организация;
		ПараметрыЗаполненияДоговора.ВалютаВзаиморасчетов = Валюта;
		ПараметрыЗаполненияДоговора.ТипДоговора = Документы.ЗаявкаНаЗакупку.ДоступныеТипыДоговоров();
		Действия.Вставить("ЗаполнитьДоговорПоУмолчанию", ПараметрыЗаполненияДоговора);
		
		Действия.Вставить("ЗаполнитьНоменклатуруПартнераПоНоменклатуре", Неопределено);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(
			Действия,
			ЗаявкаНаЗакупкуКлиентСервер.ДействияЗаполненияНалогообложенияНДС(ЭтотОбъект),
			Истина);
		
		ТоварыИсточника = ДанныеЗаполнения.Товары; // ТаблицаЗначений
		ПересчитатьСуммыПоСкорректированнымСтавкамНДС = Истина;
		Если ТоварыИсточника.Колонки.Найти("Цена") = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ЗаявкаНаЗакупкуКлиентСервер.ДействияЗаполненияЦены(ЭтотОбъект), Истина);
			ПересчитатьСуммыПоСкорректированнымСтавкамНДС = Ложь; // Расчет цен инициализирует расчет сумм.
		Иначе
			ПересчитатьСуммыПоСкорректированнымСтавкамНДС = Истина;
		КонецЕсли;
		
		// Инициализируем промежуточную таблица с гарантированным составом колонок
		//   и дополняем ее промежуточными колонками расчетов.
		ТаблицаТоваров = Товары.Выгрузить(); 
		ТаблицаТоваров.Колонки.Добавить("ХозяйственнаяОперация", Новый ОписаниеТипов("ПеречислениеСсылка.ХозяйственныеОперации"));
		
		КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ТаблицаТоваров, Действия, КэшированныеЗначения);
		
		Если ПересчитатьСуммыПоСкорректированнымСтавкамНДС
			И ЗначениеЗаполнено(КэшированныеЗначения.ОбработанныеСтроки) Тогда
			
			ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
				КэшированныеЗначения.ОбработанныеСтроки,
				ЗаявкаНаЗакупкуКлиентСервер.ДействияПересчетаСуммы(ЦенаВключаетНДС, Ложь, Истина),
				ТаблицаТоваров,
				КэшированныеЗначения);
			
		КонецЕсли;
		
		Товары.Загрузить(ТаблицаТоваров);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения)
	
	Автор = Пользователи.ТекущийПользователь();
	
	Если Не ЗначениеЗаполнено(Исполнитель) Тогда
		Исполнитель = Автор;
	КонецЕсли;
	
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, Подразделение);
	Склад = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(Склад);
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Валюта = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
	КонецЕсли;
	
	Если ДанныеЗаполнения = Неопределено
		Или ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И Не ДанныеЗаполнения.Свойство("Товары") Тогда
		// Документ вводится без предзаполнения ТЧ.
		ПоступлениеОднойДатой = Истина;
	КонецЕсли;
		
	Если Не Документы.ЗаявкаНаЗакупку.ИспользоватьЛимитыБДР() Тогда
		ЦельЗакупки = ЗаявкаНаЗакупкуКлиентСервер.ЦельЗакупкиПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнитьПоступлениеОднойДатой()

	ПоступлениеОднойДатой = Истина;
	Если Товары.Количество() > 0 Тогда

		ДатаПоступления = Товары[0].ЖелаемаяДатаПоступления;
		
		Для Каждого Строка Из Товары Цикл

			Если Строка.ЖелаемаяДатаПоступления <> ДатаПоступления Тогда
				ПоступлениеОднойДатой = Ложь;
			КонецЕсли;
			
		КонецЦикла;

		Если ПоступлениеОднойДатой Тогда
			ЖелаемаяДатаПоступления = ДатаПоступления;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

// По желаемым датам поступления выполняются поиски документов, например, исполнение планов закупки.
Процедура ЗаполнитьПустыеЖелаемыеДатыПоступления()
	
	ТекстыЗапросов = Новый СписокЗначений;
	Запрос = Новый Запрос;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	&ДатаНачала КАК ДатаНачала,
	|	Товары.Соглашение КАК Соглашение
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|ГДЕ
	|	Товары.ЖелаемаяДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)";
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(, "НомерСтроки, Соглашение, ЖелаемаяДатаПоступления"));
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДатаСеанса()));
	ТекстыЗапросов.Добавить(ТекстЗапроса, "Товары");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.ДатаНачала КАК ДатаНачала,
	|	ЕСТЬNULL(Соглашения.СрокОтгрузки, 0) + ЕСТЬNULL(Соглашения.СрокДоставки, 0) КАК СрокОтгрузки
	|ПОМЕСТИТЬ ПараметрыПоиска
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСПоставщиками КАК Соглашения
	|		ПО Товары.Соглашение = Соглашения.Ссылка";
	ТекстыЗапросов.Добавить(ТекстЗапроса, "ПараметрыПоиска");
	
	ТекстЗапроса = ОбеспечениеВДокументахСервер.ВременнаяТаблицаГодыГрафикаПредприятия();
	ТекстыЗапросов.Добавить(ТекстЗапроса, "ГодыГрафикаПредприятия");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПараметрыПоиска.НомерСтроки КАК НомерСтроки,
	|	&ЖелаемаяДатаПоступленияПереопределеяемый КАК ЖелаемаяДатаПоступления
	|ИЗ
	|	ПараметрыПоиска КАК ПараметрыПоиска
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаЗакупку КАК ЗаявкаНаЗакупку
	|		ПО (ИСТИНА)";
	
	Подстановки = ОбеспечениеВДокументахСервер.ДобавитьКДатеПоКалендарюПредприятия(
		"ПараметрыПоиска.ДатаНачала", "ПараметрыПоиска.СрокОтгрузки");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ЖелаемаяДатаПоступленияПереопределеяемый",
		Подстановки.Поле);
		
	ТекстЗапроса = ТекстЗапроса + "
	|		" + Подстановки.Соединения;
		
	ТекстыЗапросов.Добавить(ТекстЗапроса, "Результат");
	
	РезультатПакета = ОбщегоНазначенияУТ.ПолучитьРезультатыЗапроса(Запрос, ТекстыЗапросов);
	РезультатЗапроса = РезультатПакета.Результат; // РезультатЗапроса
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТоваров = Товары.Получить(Выборка.НомерСтроки - 1);
		ЗаполнитьЗначенияСвойств(СтрокаТоваров, Выборка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
